In [1]:
import pandas as pd

In [6]:
df = pd.read_csv("vehicle_trips.csv")
df

,series_name,base_number,company_name,type,timestamp,value
0,T1,B00013,LOVE CORP CAR INC,trips,2015-01-01,26.0
1,T1,B00013,LOVE CORP CAR INC,trips,2015-01-02,79.0
2,T1,B00013,LOVE CORP CAR INC,trips,2015-01-03,62.0
3,T1,B00013,LOVE CORP CAR INC,trips,2015-01-04,76.0
4,T1,B00013,LOVE CORP CAR INC,trips,2015-01-05,292.0
...,...,...,...,...,...,...
42377,T329,B01818,"TA-TA TRANSPORTATION, INC.",vehicles,2015-08-05,2.0
42378,T329,B01818,"TA-TA TRANSPORTATION, INC.",vehicles,2015-08-06,2.0
42379,T329,B01818,"TA-TA TRANSPORTATION, INC.",vehicles,2015-08-07,1.0
42380,T329,B01818,"TA-TA TRANSPORTATION, INC.",vehicles,2015-08-08,3.0
42381,T329,B01818,"TA-TA TRANSPORTATION, INC.",vehicles,2015-08-09,2.0

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42382 entries, 0 to 42381
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   series_name   42382 non-null  object
 1   base_number   42382 non-null  object
 2   company_name  42382 non-null  object
 3   type          42382 non-null  object
 4   timestamp     42382 non-null  object
 5   value         35108 non-null  float64
dtypes: float64(1), object(5)
memory usage: 1.9+ MB

In [ ]:
# find out the missing values
df.isnull().sum()

series_name        0
base_number        0
company_name       0
type               0
timestamp          0
value           7274
dtype: int64

In [9]:
# alternative to find the missing values

df.isnull().any(axis=0)

series_name     False
base_number     False
company_name    False
type            False
timestamp       False
value            True
dtype: bool

In [11]:
df.fillna(0)
df.isnull().sum()

series_name        0
base_number        0
company_name       0
type               0
timestamp          0
value           7274
dtype: int64

In [14]:
# Imputation via mean

df['value'] = df["value"].fillna(df['value']).mean()
df.isnull().sum()

series_name     0
base_number     0
company_name    0
type            0
timestamp       0
value           0
dtype: int64

In [15]:
df.dtypes

series_name      object
base_number      object
company_name     object
type             object
timestamp        object
value           float64
dtype: object

In [17]:
# Renaming columns

df = df.rename(columns={'company_name':'company'})
df.columns

Index(['series_name', 'base_number', 'company', 'type', 'timestamp', 'value'], dtype='object')

In [18]:
## change datatypes

df['value'] = df['value'].astype("float")

In [21]:
# Data aggregating and grouping

grouped_mean = df.groupby("type")['value'].mean()
grouped_mean

type
trips       105.835137
vehicles    105.835137
Name: value, dtype: float64

In [22]:
df.groupby(['company', 'type'])['value'].sum()

company                              type
1431 CAR SERVICE, INC.               trips       12911.886749
                                     vehicles    12911.886749
510 CAR SERVICE CORP                 trips       22331.213968
                                     vehicles    22437.049106
77 EXPRESS CAR & LIMO SERVICE, INC.  trips       12911.886749
                                                     ...
WATSON CAR SERVICE INC.              vehicles    15981.105731
XYZ TWO WAY RADIO                    trips       19050.324712
                                     vehicles    19156.159850
YELLOWSTONE TRANSPORTATION INC.      trips       18944.489575
                                     vehicles    19156.159850
Name: value, Length: 329, dtype: float64

In [26]:
## aggregate multiple functions
group = df.groupby(['company', 'type'])['value'].agg(['sum', 'mean', 'count'])
group

                                                       sum        mean  count
company                             type
1431 CAR SERVICE, INC.              trips     12911.886749  105.835137    122
                                    vehicles  12911.886749  105.835137    122
510 CAR SERVICE CORP                trips     22331.213968  105.835137    211
                                    vehicles  22437.049106  105.835137    212
77 EXPRESS CAR & LIMO SERVICE, INC. trips     12911.886749  105.835137    122
...                                                    ...         ...    ...
WATSON CAR SERVICE INC.             vehicles  15981.105731  105.835137    151
XYZ TWO WAY RADIO                   trips     19050.324712  105.835137    180
                                    vehicles  19156.159850  105.835137    181
YELLOWSTONE TRANSPORTATION INC.     trips     18944.489575  105.835137    179
                                    vehicles  19156.159850  105.835137    181

[329 rows x 3 columns]

In [28]:
# Merging and joining Dataframes
df1 = pd.DataFrame({'key':['A', 'B', 'C'], 'Value1': [1,2,3]})
df2 = pd.DataFrame({'key':['A', 'B', 'D'], 'Value1': [4,5,6]})

df1

  key  Value1
0   A       1
1   B       2
2   C       3

In [29]:
df2

  key  Value1
0   A       4
1   B       5
2   D       6

In [33]:
## Merge Dataframe on the 'key' column 
## inner join, outer join, left and right

pd.merge(df1, df2, on="key", how='inner')

  key  Value1_x  Value1_y
0   A         1         4
1   B         2         5

In [34]:
pd.merge(df1, df2, on="key", how='outer')

  key  Value1_x  Value1_y
0   A       1.0       4.0
1   B       2.0       5.0
2   C       3.0       NaN
3   D       NaN       6.0

In [35]:
pd.merge(df1, df2, on="key", how='left')

  key  Value1_x  Value1_y
0   A         1       4.0
1   B         2       5.0
2   C         3       NaN

In [36]:
pd.merge(df1, df2, on="key", how='right')

  key  Value1_x  Value1_y
0   A       1.0         4
1   B       2.0         5
2   D       NaN         6